{
    "projects": [
        {
            "image_url": "../../images/logo_townaide.png",
            "title": "Townaide",
            "post_id": "townaide",
            "short_description": "I was the co-founder of Townaide along with my father. It was a platform where people could add local information and get paid for it. I was responsible for everything technical. I built everything from scratch.",
            "github_url": "",
            "date": "June 3rd, 2020",
            "content": [
                {
                    "type": "text",
                    "content": "<p>I co-founded Townaide with my Father and Brother at the start of 2018 in Somerset West, South Africa. I had just finished my Master's degree and was very keen to try to get a tech startup going. The idea behind Townaide is that locals keep the information of the platform up to date by adding and reviewing new listings and in return, they get their share of the profits. It is very similar to Google Maps in that you can browse and find places of interest, bars, restaurants, etc. nearby or in a location of your choice.</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>The original tech, as my father had put an idea together, was running off of Wordpress. Wordpress is great for all sorts of websites and I tried to get the idea working with Wordpress but I ran into some difficulties trying to build an API around it for the mobiles apps and I wasn't a big fan of the Wordpress styling either. I started by using a simple ReactJS website for the home page (we didn't have a dashboard yet). It was a simple website that just showed what Townaide did and links (eventually) to the apps. I chose ReactJS because I didn't know the framework and wanted to learn it as I had heard a lot of good things about it online. So creating a simple website was an easy way to learn the basics. The screenshot of the website below is after two years of development. I had added an interactive map to the home screen that could display the markers for a user based on their location (either by giving us their location permission or IP location).</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/townaide/townaide_home_1.png",
                    "alt": "Townaide home page"
                },
                {
                    "type": "text",
                    "content": "<p>There were two types of users on Townaide. A normal user and a lister. The users were everyday people that would use the platform to find what they were looking for and listers were the people who kept the information up to date and added new information in their areas. The dashboard was made for listers to view the listings that they had added and view, review and check their balances. It was also a way that we, the founders, could communicate with the listers.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/townaide/townaide_dashboard_1.png",
                    "alt": "Townaide dashboard home"
                },
                {
                    "type": "text",
                    "content": "<p>The listers would be able to see which listings are bringing in the most money and be able to focus on certain types of listings to increase their returns. The dashboard also had a section for super admins to view analytics for the entire platform. We were able to view a heat map of were most listings were added and the listing density for each of the listers.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/townaide/townaide_dashboard_2.png",
                    "alt": "Townaide dashboard listings"
                },
                {
                    "type": "text",
                    "content": "<p>To make the platform more accessible we decided that we need mobile apps. I had learnt Java in university and learn Android by watching 200 YouTube videos over a couple of weeks (Here's the <a href='https://www.youtube.com/playlist?list=PL2F07DBCDCC01493A'>link</a> to the YouTube playlist. It will most likely be out of date seeing as it was made in 2014). I had never done any sort of programming on iOS before so I started by scratching around on YouTube and found loads of tutorials on how do get started. I also bought a few courses from Udacity to help me learn quicker. I started by learning Swift and it looked much easier and more promising that objective C. The app shown below is all iOS and the Android version looks the same.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/townaide/townaide_ios_1.png",
                    "alt": "Townaide iOS app"
                },
                {
                    "type": "text",
                    "content": "<p>Building Townaide taught me a lot. I had to tackle real-world problems and write scalable code (like having to write tests for the code because it's no fun searching through Swift code after spending all day writing Javascript). I had to learn how to optimize queries to a PostgreSQL database as we had over 12 million listings and 10 000 users and you don't want one person to crash the whole database or server just because the query was looking through all 12 million listings to find a barber around the corner. I had to streamline all the processes like interacting CI into the workflow so that the code was tested before deploying.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/townaide/townaide_ios_2.png",
                    "alt": "Townaide iOS app"
                },
                {
                    "type": "text",
                    "content": "<p>Thanks for reading my short overview of Townaide and the role I played in it. If you would like to find out more or ask me a question regarding choices I made feel free to get in contact with me on Twitter.</p>",
                    "alt": ""
                }
            ]
        },
        {
            "image_url": "../../images/logo_traxart.png",
            "title": "Traxart",
            "post_id": "traxart",
            "short_description": "I recently became the co-founder adn CTO of Traxart. It started off as a platform to allows presenters to get better feedback about their presentations. Just after the COVID-19 pandemic started we had to pivot and now the platform specializes in sending hyper personalized emails to attendees of webinars.",
            "github_url": "",
            "date": "June 28th, 2020",
            "content": [{
                    "type": "text",
                    "content": "<p>I joined Matt as a co-founder of Traxart at the beginning of March 2020. There was already a basic version of the platform that allowed users to asks questions and answer polls during events. This was all pre COVID-19. I started with a complete overhaul of the UI as the previous platform was very simple. The front end was built in ReactJS and the API was build using NestJS. I had never used NestJS before but it was build on NodeJS and Express which I already had loads of experience with. Fot the UI I decided to go for a clean flat look as you can see in the images below.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_login.png",
                    "alt": "Traxart login"
                },
                {
                    "type": "text",
                    "content": "<p>After working on Traxart for a couple of weeks, the COVID-19 lockdowns began and all of the physical events were being cancelled. We had to pivot as the product relied on physical events. Our first idea was just to adapt the way it was used in physical events and use that in online events. This was an easy pivot but we quickly realized that most of the video platforms like Zoom or GoTo had this sort of functionality and people weren't to concerned about viewing the analytics of their presentations. Going this route we would also have to take on Slido which had majority of the market.</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>After doing some research and talking to loads of people we started to notice that there was a gap in the market. This was with using the data that the video platforms gave you and using it to send hyper personalized emails to potential leads. All the data was there but no one was using it. This was a bigger pivot that before as we didn't have any of the functionality. We decided to integrate with Zoom first as they have most of the market. We looked at using integration tools like Zapier but they were very limited.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_home.png",
                    "alt": "Traxart dashboard home"
                },
                {
                    "type": "text",
                    "content": "<p>The integration allows users to link Traxart with their Zoom account. Once this was done, all that was needed was either the meeting or webinar ID. The system checks to make sure that all of the settings are correct and that Traxart can use the event data. To create a Zoom integration, you have to submit it to Zoom and they review it before it can go live to the public. Our integration took over 6 weeks to get approved so in this time we created a work around. Users could manually download the Zoom reports and upload it directly to Traxart. This would be needed for some integrations in the future as not all the video platforms have API's to tie into. The above image shows the list of events added by a user. Zoom being from the Zoom integration and Custom being the file upload method.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_template.png",
                    "alt": "Traxart edit template"
                },
                {
                    "type": "text",
                    "content": "<p>Once an event was added successfully, the user would be redirected to the template page. Here all the data would be available such as registration questions, polls, Q&A, duration etc. The user could use this information to design an email template to send to each one of the registrants. The image above shows the template editor and the image below shows the ease of adding a different field to the email template.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_edit_template.png",
                    "alt": "Traxart edit template field"
                },
                {
                    "type": "text",
                    "content": "<p>Once a user has designed the template to send to each of the registrants, they would click generate of the event list page. This will take all of the data and the template and construct an email for each of the registrants. The image below shows the page after the emails have been generated. You can see the total number of registrants, attendees, the percentage of emails opened and clicked. Another feature we added in to make the process and seamless as possible was to send emails directly from within Traxart. All you need to do is verify the email address you want to send from. You can send a test email to yourself, this will randomly select an email and send it to the email address of the Traxart account.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_emails.png",
                    "alt": "Traxart generated emails"
                },
                {
                    "type": "text",
                    "content": "<p>You can also view each of the individual emails generated to make sure you're happy with the results or look. The only thing left to do is to click the send button and come back in a few hours to view the open and click rate of your follow up emails.</p>",
                    "alt": ""
                },
                {
                    "type": "image",
                    "content": "../../images/blog_posts/traxart/traxart_email_preview.png",
                    "alt": "Traxart email preview"
                },
                {
                    "type": "text",
                    "content": "<p>The work so far on Traxart has been extremely interesting! I have be able to work with new features in AWS and Azure, I've learnt a new framework for designing REST API's and improved my TypeScript skills. All while trying to figure out which will be the best path for Traxart to follow during the COVID-19 pandemic. If you would like to check out Traxart you can have a look <a href='https://www.traxart.co'>here</a> or if you would like to find out more or ask me a question regarding choices I made feel free to get in contact with me on Twitter.</p>",
                    "alt": ""
                }
            ]
        },
        {
            "image_url": "../../images/logo_lemon_law.png",
            "title": "Lemon Law",
            "post_id": "lemon-law",
            "short_description": "This was a personal project that I started and am still busy with. It is a dating app that allows users to chat via text (anonymously) for 200 seconds and then if they both agree to continue the conversation they match and can see more information about eachother.",
            "github_url": "",
            "date": "June 5th, 2020",
            "content": [{
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                }
            ]
        },
        {
            "image_url": "../../images/logo_soltero.png",
            "title": "Soltero",
            "post_id": "soltero",
            "short_description": "This was a personal project that I started and am still busy with. It is very similar to Instagram by you are only allowed to post once every 24 hours and has the same layout as TikTok.",
            "github_url": "",
            "date": "June 5th, 2020",
            "content": [{
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                },
                {
                    "type": "text",
                    "content": "<p>Some content</p>",
                    "alt": ""
                }
            ]
        }
    ]
}